import LocaleBase from "./localeBase";

export default class Fa extends LocaleBase {
    constructor() {
        super();

        this.gregorian = {
            months: ["ژانویه", "فوریه", "مارس", "آوریل", "مه", "ژوئن",
                "ژوئیه", "اوت", "سپتامبر", "اکتبر", "نوامبر", "دسامبر"],
            monthsShort: ["ژانویه", "فوریه", "مارس", "آوریل", "مه", "ژوئن",
                "ژوئیه", "اوت", "سپتامبر", "اکتبر", "نوامبر", "دسامبر"],
            weekdays: ["یک‌شنبه", "دوشنبه", "سه‌شنبه", "چهارشنبه", "پنج‌شنبه", "آدینه", "شنبه"],
            weekdaysShort: ["یک", "دو", "سه", "چهار", "پنج", "آد", "شنبه"],
            weekdaysMin: ["ی", "د", "س", "چ", "پ", "ج", "ش"],
        };

        this.persian = {
            months: ["فروردین", "اردیبهشت", "خرداد", "تیر", "مرداد", "شهریور",
                "مهر", "آبان", "آذر", "دی", "بهمن", "اسفند"],
            monthsShort: ["فرو", "ارد", "خرد", "تیر", "مرد", "شهر",
                "مهر", "آبا", "آذر", "دی", "بهم", "اسف"],
            weekdays: ["شنبه", "یکشنبه", "دوشنبه", "سه‌شنبه", "چهارشنبه", "پنج‌شنبه", "آدینه"],
            weekdaysShort: ["شنبه", "یک", "دو", "سه", "چهار", "پنج", "آد"],
            weekdaysMin: ["ش", "ی", "د", "س", "چ", "پ", "ج"],
        };

        this.kurdish = {
            months: ["خاکلیوٍَ", "گُلان", "جوز‌َردان", "پوشپَر", "گلاویژ", "خرمانان",
                "رَزبَر", "گلاریزان", "سرماوز", "بَفرانبار", "ریبندان", "رَشَمی"],
            monthsShort: ["خاک", "گل", "جوزرد", "پوشپَر", "گلاویژ", "خرمان",
                "رَزبَر", "گلاریز", "سرما", "بَفران", "ریبند", "رَشَمی"],
            weekdays: ["شنبه", "یکشنبه", "دوشنبه", "سه‌شنبه", "چهارشنبه", "پنج‌شنبه", "آدینه"],
            weekdaysShort: ["شنبه", "یک", "دو", "سه", "چهار", "پنج", "آد"],
            weekdaysMin: ["ش", "ی", "د", "س", "چ", "پ", "ج"],
        };

        this.islamic = {
            months: ["محرم", "صفر", "ربیع‌الاول", "ربیع‌الثانی", "جمادی‌الاول", "جمادی‌الثانی",
                "رجب", "شعبان", "رمضان", "شوال", "ذیقعده", "ذیحجه"],
            monthsShort: ["محر", "صفر", "ربیع۱", "ربیع۲", "جمادی۱", "جمادی۲",
                "رجب", "شعب", "رمض", "شو", "ذیقع", "ذیحج"],
            weekdays: ["شنبه", "یکشنبه", "دوشنبه", "سه‌شنبه", "چهارشنبه", "پنج‌شنبه", "آدینه"],
            weekdaysShort: ["شنبه", "یک", "دو", "سه", "چهار", "پنج", "آد"],
            weekdaysMin: ["ش", "ی", "د", "س", "چ", "پ", "ج"],
        };

        this.numbers = ["۰", "۱", "۲", "۳", "۴", "۵", "۶", "۷", "۸", "۹"];

        this.amPm = ["ق.ظ", "ب.ظ"];
    }
}
